package com.example.timeoff;

public class todo {
//    Реализовать окна входа и регистрации(окно входа уже сделано)
//    Узнать, как поровнять кнопки
//    Узнать про круглые кнопки
//    Узнать про toggle button
//    TODO: Как работают картинки, почему зеленый фон, как его убрать
//    Узнать как сделать историю в личном кабинете
//    Узнать как рабоатет логотип(неровно втсавляется)
//    Реализовать главный экран, сделать новости и текст для них, также добавить таймер, который будет появлться при брони
//    TODO: (узнать, как сделать таймер в плане дизайн, в каком именно layout его писывать)
//    Как сделать функционал кнопки "Назад" в диалоговом окне, обработчик не работает для второй кнопки.
//    TODO: Почему обработчик спинера срабатывает при открытии фрагмента
//    Узнать, как сделать бонусы в личном кабинете, каким объектом это обозначить
//    Узнать, как делать тени для блоков в меню и тд.
//    В корзину добавлять и развелечения тоже
//    Сделать выбор комнаты
//    Сделать бронирование комнаты
//    Сделать Меню еды
//    Сделать Меню развлаечений
//    Сделать подробное описание игры
//    Сделать элемент корзины
//    Сделать элемент меню еды и развлечений
//    Сделать диалоговое окно "подробнее" у игры в меню развлечений
//    Сделать сделать корзину в меню
//    Сделать личный кабинет
//    Узнать, как сделать скрол личного кабинет, чтобы можно было просматривать историю, как это сделать дизайном
}
